leetcode_2455_average_value_of_even_numbers_that_are_divisible_by_three.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2455. Average Value of Even Numbers That Are Divisible by Three</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2455. Average Value of Even Numbers That Are Divisible by Three</h1>

<div id="outline-container-org7f8586a" class="outline-2">
<h2 id="org7f8586a">Understand the problem</h2>
<div class="outline-text-2" id="text-org7f8586a">
<p>
Find the median of numbers divisible by 2 and 3.
</p>
</div>
</div>

<div id="outline-container-orga48b3c0" class="outline-2">
<h2 id="orga48b3c0">Devise the plan</h2>
<div class="outline-text-2" id="text-orga48b3c0">
<p>
Filter numbers divisible by 6 and compute their average.  Time and space complexity is \(O(n)\).
</p>
</div>

<div id="outline-container-org2e5fe19" class="outline-3">
<h3 id="org2e5fe19">Carry out the plan</h3>
<div class="outline-text-3" id="text-org2e5fe19">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">averageValue</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        xs = [n <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> nums <span style="font-weight: bold;">if</span> n % 2 == 0 <span style="font-weight: bold;">and</span> n % 3 == 0]
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> xs:
            <span style="font-weight: bold;">return</span> 0
        <span style="font-weight: bold;">return</span> floor(<span style="font-weight: bold;">sum</span>(xs) / <span style="font-weight: bold;">len</span>(xs))
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>